#Generated by Fabric Compiler ( version 2022.2-SP6.1 <build 138931> ) at Sun Mar  2 17:53:55 2025

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module remote_updata_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -enable_watchdog_in_configuration_mode true -load_watchdog {c00000} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module remote_updata_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -enable_watchdog_in_configuration_mode true -load_watchdog {c00000} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module remote_updata_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -enable_watchdog_in_configuration_mode true -load_watchdog {c00000} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module remote_updata_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -enable_watchdog_in_configuration_mode true -load_watchdog {c00000} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module remote_updata_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -enable_watchdog_in_configuration_mode true -load_watchdog {c00000} 
